# Part 1

# 3.Import your analysis libraries, as well as your new customer data set as a dataframe.

In [3]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [5]:
# string
path =r'/Users/juliapetke/Desktop/Career Foundry/Instacart Basket Analysis'

In [7]:
# import of new customers.csv
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [14]:
# check imported customer data
df_cust.head (10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [16]:
# Check the dimensions of the dataframe
df_cust.shape

(206209, 10)

In [18]:
# View descriptive statistics 
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [20]:
# Check data types
df_cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis

In [26]:
# Rename the columns to establish uniformity
df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [28]:
df_cust.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [30]:
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [32]:
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [34]:
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [36]:
df_cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [38]:
# Check columns
df_cust.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [40]:
df_cust.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [42]:
# The columns are successfully renamed and are now uniform and clear

In [44]:
# for dropping columns, i suggest that all columns be kept as they are useful for the analysis

# 5. Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [47]:
# Address data-types and potential mixed data-types in the dataframe
df_cust.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [53]:
# Checking for mixed data-types in each column
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

In [55]:
# first_name has mixed data type and should be addressed
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [59]:
# the user_id column is listed as int and needs to be addressed
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [61]:
# Re-check the data-types in the data frame and for mixed data-types
df_cust.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [63]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [65]:
# Check for missing data
df_cust.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [69]:
# Check for full-duplicates
df_cust_dups = df_cust[df_cust.duplicated()]

In [71]:
df_cust_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [73]:
# Perform a descriptive statistic to check for abnormalities 
df_cust.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [75]:
# there is nothing unsual in the descriptive stastics

# 6. Combine your customer data with the rest of your prepared Instacart data.

In [78]:
# Import the rest of the prepared Instacart data
orders_products = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_new_variables_4.8.pkl'))

In [80]:
# check the shape of the newly imported dataframe
orders_products.shape

(1000000, 23)

In [82]:
# check the shape of the customer dataframe
df_cust.shape

(206209, 10)

In [84]:
# Identify a shared column
orders_products.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,...,_merge,merge_indicator,price_range,busiest_day,slowest_days,busiest_period_of_day,average_spend,spender_flag,customer_frequency,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,both,both,Mid-range product,Regularly busy,Regularly busy,Most orders,12.900000,High_spender,6.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,both,both,Mid-range product,Regularly busy,Regularly busy,Average orders,12.900000,High_spender,6.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,both,both,Mid-range product,Busiest days,Regularly busy,Average orders,5.288889,Low_spender,6.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,both,both,Mid-range product,Regularly busy,Slowest days,Most orders,5.800000,Low_spender,4.5,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,both,both,Mid-range product,Regularly busy,Slowest days,Average orders,5.800000,Low_spender,4.5,Frequent customer

In [86]:
df_cust.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [88]:
# Both dataframes share the 'user_id' column
# Check data-type of shared column
orders_products.dtypes['user_id']

dtype('int64')

In [90]:
df_cust.dtypes['user_id']

dtype('O')

In [94]:
# Making sure both key columns are the same data type
orders_products['user_id'] = orders_products['user_id'].astype('str')

In [96]:
orders_products.dtypes['user_id']

dtype('O')

In [98]:
# The key columns now have matching data-types

In [100]:
# Drop the existing '_merge' column from previous exercises
orders_products = orders_products.drop(columns=['_merge'])

In [102]:
# Merge the two dataframes using the column 'user_id' as the shared column with the default join (inner)
custs_ords_prods = orders_products.merge(df_cust, on = 'user_id', indicator = True)

In [104]:
# This new dataframe merges the customers and orders_products dataframes, using the 'user_id' column as the key.

In [106]:
# Check shape of newly merged dataframe
custs_ords_prods.shape

(1000000, 32)

In [108]:
custs_ords_prods.head(10)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_time_of_day,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
5,1,Chocolate Sandwich Cookies,61,19,5.8,1701441,777,16,1,7,...,Christina,Wallace,Female,Hawaii,51,1/4/2019,2,married,57797,both
6,1,Chocolate Sandwich Cookies,61,19,5.8,1871483,825,3,2,14,...,nan,Parks,Male,District of Columbia,20,5/8/2019,3,living with parents and siblings,34171,both
7,1,Chocolate Sandwich Cookies,61,19,5.8,1290456,910,12,3,10,...,Sandra,Trejo,Female,Tennessee,65,7/25/2019,0,divorced/widowed,44856,both
8,1,Chocolate Sandwich Cookies,61,19,5.8,369558,1052,10,1,20,...,Ralph,Avalos,Male,Oregon,72,3/30/2018,1,married,153843,both
9,1,Chocolate Sandwich Cookies,61,19,5.8,589712,1052,15,1,12,...,Ralph,Avalos,Male,Oregon,72,3/30/2018,1,married,153843,both

In [110]:
# Check inner join value counts
custs_ords_prods['_merge'].value_counts()

_merge
both          1000000
left_only           0
right_only          0
Name: count, dtype: int64

In [112]:
# Check data-types
custs_ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_time_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
merge_indicator           category
price_range                 object
busiest_day                 object
slowest_days                object
busiest_period_of_day       object
average_spend              float64
spender_flag                object
customer_frequency         float64
frequency_flag              object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
marital_status              object
income                       int64
_merge                    category
dtype: object

# 8. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [115]:
custs_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merged.pkl'))

In [ ]:
# importing dataframe
cust_ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'cust_ords_prods_merge.pkl'))